Repository: GustavoPaggiatto/reservation
Catalog: Site/*-app/src/locale/messages.*.xlf
Languages: br

# addFavorites
source: Add Favorities
br: Add Favoritos

# remFavorites
source: Rem. Favorities
br: Rem. Favoritos

source: EDIT
br: EDITAR

source: Contact Name
br: Nome do Contato

source: Contact Type
br: Tipo do Contato

# contactPhone
source: Phone
br: Telefone

# contactBirthDate
source: Birthdate
br: Aniversário

# createContact
source: Create
br: Criar

# editContact
source: Edit
br: Editar

source: List Contacts
br: Lista de Contatos

source: Create Reservation
br: Criar Reserva

source: Edit Reservation
br: Editar Reserva

source: Name
br: Nome

source: Phone
br: Telefone

source: Birth Date
br: Aniversário

source: Delete
br: Excluir

# errorContactTypes
source: An error occuring while get contact types, please retry.
br: Ocorreu um erro ao obter os tipos dos contatos, tente novamente.

# errorGetContact
source: An error occuring while get contact, please retry.
br: Ocorreu um erro ao recuperar os dados do contato, tente novamente.

# nameEmpty
source: Name is empty.
br: Nome não informado.

# birthDateEmpty
source: Birthdate is empty or invalid.
br: Data de aniversário não preenchida

# contactTypeEmpty
source: Contact Type not selected.
br: Tipo do contato não selecionado.

# createContactComplete
source: Create Contact.
br: Criar Contato.

# contactCreateSuccess
source: Contact was saved with success!
br: Contato salvo com sucesso!

# postError
source: Error occured while 'POST' request (view logs for more details).
br: Ocorreu um erro durante o POST dos dados para o servidor (veja os logs para mais detalhes).

# listReservation
source: Reservation List
br: Lista de Reservas

# errorGetReserves
source: An error occuring while get reserves, please retry.
br: Ocorreu um erro ao recuperar as reservas, tente novamente.

# errorSetRanking
source: An error occuring while set ranking, please retry.
br: Ocorreu um erro ao setar o ranking, tente novamente.

# errorSetFavorite
source: An error occuring while set favorite, please retry.
br: Ocorreu um erro ao setar os favoritos, tente novamente.

# reservationOnly
source: Reservation.
br: Reserva

# errorReserveData
source: An error occuring while get reserve data, please retry.
br: Ocorreu um erro ao recuperar os dados da reserva, tente novamente.

# errorContactData
source: An error occuring while get contacts, please retry.
br: Ocorreu um erro ao receber os contatos, tente novamente.

# contactNotSelected
source: Contact was not selected.
br: Contato não foi selecionado.

# reservaDescriptionNotFill
source: Reserve description is not fill.
br: Descrição da reserva não preenchida.

# reservaCreationSuccess
source: Reservation was created with success!
br: Reserva salva com sucesso!

# errorCreateReserve
source: An error occuring while sending reserve, please retry.
br: Ocorreu um erro ao salvar a reserva, tente novamente.

# contactDeleteSuccess
source: Contact was deleted with success!
br: Contato excluído com sucesso!

# errorContactCreate
source: An error occuring while deleting contact, please retry.
br: Ocorreu um erro ao excluir o contato, tente novamente.

# order
source: Sort By
br: Ordenar por

source: Select
br: Selecione

# orderDateAsc
source: By Date Ascending
br: Data crescente

# orderDateDesc
source: By Date Descending
br: Data decrescente

# orderNameAsc
source: By Alphabetic Ascending
br: Nome crescente

# orderNameDesc
source: By Alphabetic Descending
br: Nome decrescente

# orderRanking
source: By Ranking
br: Por Ranking

# emptyDatabase
source: There are no records in the database
br: Não há registros na base de dados

# errorPhone
source: Phone only accept numbers.
br: O campo telefone só aceita números.

# reserveDatePassed
source: Invalid date (passed).
br: Data inválida (passado).

# reserveDateNotFill
source: Reserve date is empty or invalid.
br: Data da reserva não informada/inválida.

# birthDateAfter
source: Birth date invalid (future).
br: Data da aniversário inválida (futura).

# questionMessage
source: Do you really want to proceed?
br: Deseja realmente prosseguir?
